{
  "personalInfo": {
    "name": "Bhargavi Govardhanam",
    "title": "Senior Frontend / Full-Stack Engineer",
    "email": "bhargavig.594@gmail.com",
    "location": "Dallas-Fort Worth Metroplex",
    "github": "",
    "linkedin": "www.linkedin.com/in/gobhargavi",
    "website": "",
    "summary": "Senior Frontend / Full-Stack Engineer with 11 years of experience building large-scale, UI-heavy web applications across healthcare, fintech, retail, and logistics domains. Deep expertise in React, TypeScript, and modern frontend architecture, with strong backend integration using Node.js and microservices. Proven track record of designing and delivering enterprise-grade user interfaces that support high-volume, real-time systems and mission-critical workflows. Have built and scaled platforms supporting tens of thousands of users, complex transactions, and performance-sensitive dashboards in production environments. Recently led frontend development for a production GenAI RAG chatbot, designing conversational UI flows, grounded response views, and feedback mechanisms while integrating with GPT-4, vector search, and backend AI services. Focused on making AI systems usable, reliable, and valuable for real users. Known for end-to-end ownership, clean and maintainable UI architecture, performance optimization, and close collaboration with backend, product, and design teams to deliver measurable business impact.",
    "image": "https://i.pravatar.cc/300"
  },
  "experience": [
    {
      "company": "Point B Communications",
      "position": "Sr. Full Stack Frontend Engineer",
      "startDate": "November 2023",
      "endDate": "Present",
      "description": "Architected scalable, component-driven frontend platforms using React and Next.js, establishing atomic design systems and shared UI libraries that accelerated enterprise feature delivery and improved UI consistency across teams. Designed and delivered complex, UI-heavy workflow systems with dynamic validation, real-time state management, and role-based behavior, significantly reducing manual configuration effort and operational friction. Built and owned a Node.js Backend-for-Frontend (BFF) layer to support frontend-specific data needs, collaborating closely with backend teams to define API contracts, optimize payloads, and enforce authentication and security standards. Led frontend development for a production-grade GenAI RAG chatbot, designing conversational UX, grounded response views, and feedback loops while integrating with LLM, vector search, and backend AI services for low-latency, context-aware responses. Optimized application performance using SSR, SSG, and ISR strategies, combined with CDN-based delivery and caching, resulting in faster load times and improved global user experience. Implemented frontend and API observability and monitoring, enabling proactive issue detection and improving production reliability for business-critical applications. Mentored engineers on scalable frontend architecture, TypeScript best practices, and performance optimization, raising overall code quality and strengthening team delivery velocity.",
      "companyUrl": "",
      "location": ""
    },
    {
      "company": "University of Massachusetts",
      "position": "Frontend Engineer",
      "startDate": "November 2021",
      "endDate": "August 2023",
      "description": "Designed and developed a live, production-grade University Library website, delivering a responsive and accessible user interface currently in use for academic operations. Led frontend development for DiaFriend, a healthcare mobile application prototype focused on usability-driven design and accessibility, recognized for strong interaction quality and user experience.",
      "companyUrl": "",
      "location": ""
    },
    {
      "company": "Tazapay",
      "position": "FullStack Developer - Frontend",
      "startDate": "November 2020",
      "endDate": "July 2021",
      "description": "Led frontend development of secure escrow and cross-border payments modules using Angular and TypeScript, delivering complex, multi-step transaction workflows for international financial operations. Designed and implemented advanced reactive form architectures using FormBuilder, FormArray, and custom validators to support KYC, compliance, and payment authorization flows with strict data integrity requirements. Applied advanced JavaScript and RxJS patterns to manage asynchronous payment workflows, optimize UI performance, and ensure predictable state handling across high-risk financial transactions. Collaborated closely with backend and DevOps teams to integrate REST APIs and deploy Angular applications via AWS S3 and CloudFront, enabling reliable, low-latency global access across multiple regions.",
      "companyUrl": "",
      "location": "Singapore"
    },
    {
      "company": "Hotfoot Technology Solutions",
      "position": "Frontend Developer",
      "startDate": "July 2019",
      "endDate": "October 2020",
      "description": "Developed and owned UI architecture for high-traffic loan-processing modules using Angular, building reusable components, and orchestrating complex customer onboarding and eligibility workflows. Implemented responsive, performance-optimized user interfaces integrated with backend services, improving reliability and usability across critical financial workflows. Diagnosed and resolved production issues through systematic root-cause analysis and asynchronous debugging, ensuring application stability in live environments. Mentored junior developers on frontend best practices, component design, and maintainable Angular patterns, contributing to improved team code quality.",
      "companyUrl": "",
      "location": "Chennai Area, India"
    },
    {
      "company": "Cognizant",
      "position": "Programmer Analyst",
      "startDate": "November 2015",
      "endDate": "April 2019",
      "description": "Developed and scaled enterprise web applications for Fortune 500 clients across e-commerce, logistics, and healthcare domains, contributing to high-traffic, business-critical platforms used by millions of users. Walmart (E-commerce): Engineered high-performance React modules for product catalog, shopping cart, and checkout workflows, supporting traffic peaks of 1M+ daily transactions with sub-2-second load times using optimized state management and efficient data flows. JB Hunt (Logistics): Built real-time operational dashboards tracking 25K+ active fleet operations, integrating REST APIs for live shipment tracking and route optimization with sub-second refresh latency. Recognized with the Extra Mile Award (Q1 2017) for exceptional delivery and client impact. AstraZeneca (Healthcare): Delivered HIPAA-compliant patient portals serving 30K+ users, implementing secure authentication, role-based authorization, data validation, and WCAG 2.1 AA accessibility standards. Led cross-project performance optimization initiatives, including code-splitting, lazy loading, and caching, reducing page load times by ~40% and maintaining 99% SLA adherence across production systems. Built reusable frontend components and services using AngularJS and React, reducing code redundancy and improving maintainability across multiple client projects. Collaborated within Agile/Scrum teams to deliver features on schedule, working closely with QA, backend, and client stakeholders in fast-paced enterprise environments.",
      "companyUrl": "",
      "location": "Chennai Area, India"
    },
    {
      "company": "PERFEXION INFORMATION TECHNOLOGIES PRIVATE LIMITED",
      "position": "Java Application Developer",
      "startDate": "April 2015",
      "endDate": "October 2015",
      "description": "Contributed to the development of Java-based web applications, implementing backend logic, database interactions, and RESTful services as part of an enterprise delivery team. Gained foundational experience in full application lifecycle development, debugging, and production support in a client-facing environment.",
      "companyUrl": "",
      "location": ""
    }
  ],
  "education": [
    {
      "institution": "University of Massachusetts Dartmouth",
      "degree": "Master of Science - MS, Computer Science",
      "startDate": "September 2021",
      "endDate": "August 2023",
      "description": "",
      "institutionUrl": ""
    },
    {
      "institution": "Anna University Chennai",
      "degree": "Bachelor of Engineering (B.E.), Computer Science",
      "startDate": "2011",
      "endDate": "2015",
      "description": "",
      "institutionUrl": ""
    }
  ],
  "certifications": [
    {
      "name": "Python",
      "date": "",
      "description": ""
    },
    {
      "name": "Ultimate AWS Certified Solutions Architect Associate 2026",
      "date": "",
      "description": ""
    }
  ],
  "honorsAwards": [
    {
      "name": "Extra Mile Award",
      "date": "",
      "description": ""
    }
  ],
  "skills": [
    "Generative AI",
    "Docker",
    "Node.js"
  ],
  "publications": [],
  "talks": [],
  "projects": [],
  "languages": [],
  "interests": [],
  "softSkills": []
}